---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures
source: html/ffe4cef2-91c7-7c90-ad7f-374becc6feb9.htm
---
# BuiltInFailures.AutoJoinFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.